import React from 'react'

const Skill = () => {
  return (
    <section id="skill">
      <div className="skill__inner">
        <h2 className="skill__title">
          challenge <em>나의 도전</em>
        </h2>
        <div className="skill__desc">
          <div>
            <span>1.</span>
            <h3>매순간 도전하는 삶을 살고자 한다.</h3>
            <p>
              한번의 경험이 없으면 한번의 지혜가 자라지 않는다라는 저의 신념으로 늘 살아왔습니다.
              제 인생을 살면서 하고자 하는 일을 매번 노력해서 그 경험들을 얻고 만들어왔습니다. 
              저의 이러한 성향들과 신념이 모여 더 나은 삶을 위해 꾸준히 노력하고 성취하는 결과를 가져올것이라 믿습니다.
            </p>
          </div>

            <span>2.</span>
            <h3>유연한 사고를 가졌다.</h3>
            <p>
              다양한 사람들과 많은 일들을 경험하고 나니 타인의 생각을 수용할수있는 범위가 넓어졌습니다.
              "나와 다를수 있다"를 늘 생각하며 지내다보니 상대방과의 의견이 다를때마다 유연하게 생각하는자세를 가지게 되었습니다
              업무를 할때에도 함께 협업해야 하는 업무에 있어서 이러한 유연한 사고로 일처리 능력을 향상시킬수 있다고 생각합니다. 
            </p>

            <span>3.</span>
            <h3>끈기를 가졌다.</h3>
            <p>
              제 끈기는 특히 어려운 문제를 해결하거나 장기적인 목표를 달성하는 데 도움이 됩니다. 어떤 일이든 시작부터 끝까지 집중하고, 중간에 어려움을 만나도 포기하지 않고 계속해서 노력하며 성공을 추구합니다.
              또한, 제 끈기는 팀 프로젝트나 협업 과정에서도 빛을 발합니다. 다른 사람들과 협력하면서 문제를 해결하고 목표를 달성하기 위해 열심히 일하며, 동료들을 독려하고 지원합니다. 저의 끈기는 주변 사람들에게 긍정적인 영향을 미치며, 
              함께 일하는 환경을 개선하는데 도움을 줍니다.
              끈기를 가진 개인으로서, 어떤 일도 완수하고 성공을 이루는 데 최선을 다하고 있습니다. 이를 통해 제 경력과 성공적인 경험을 쌓아오고 있으며, 앞으로도 새로운 도전을 두려워하지 않고 꾸준한 성장을 추구하려고 합니다.
              
            </p>
        </div>
      </div>
    </section>
  )
}

export default Skill